----------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/scott_cunningham/Dropbox/Workshop/Texas/Do/fig2_eventstudy.log
  log type:  text
 opened on:  12 Mar 2019, 06:41:24

. 
. *==============================================================================*
. * Prison Measures (only right for total incarceration)
. *==============================================================================*
.   note: Missing Value States:                                                                                                   ///
>                 Total Incarceration Rate: DC

.                 
. * a) Estimating the event study
.   foreach i of numlist 1/7 9/51 {                                                                                               // Loo
> p over states
  2.   foreach x in totalprison lntotalprison lnjurisdiction lnjurisdiction_rate {   // Loop over each variable
  3.                 
.         * Prepare the data set
.         qui use if year >= 1985 & year <= 2003 using $data/mainfile.dta, replace
  4.         ren (lntotal_prison_rate total_prison_rate lntotal_jurisdiction lntotal_jurisdiction_rate) (lntotalprison totalprison lnjur
> isdiction lnjurisdiction_rate)
  5.                                 
.         forvalues t = 1985/2003 {                                                                                                     
>   // Creating treatment variables
  6.         qui gen treat`t' = dummy_`t' * sdumm`i'
  7.         }
  8.         drop treat1993                                                                                                             
>              // Excluding the year of the treatment as the comparison year
  9.                 
.         * Regressions.
.         * 1. time-variant controls, no state quadratic trends, no linear state trends.
.                 qui reghdfe `x' treat1985-treat2003 white-lunch, absorb(statefip year)                  
 10.                 
.                 * Store the estimates
.                 qui gen treat_b = .
 11.                 qui gen treat_N = .
 12.                 
.                 foreach t of numlist 1985(1)1992 1994(1)2003 {
 13.                 qui replace treat_b=_b[treat`t'] if year == `t'
 14.                 qui replace treat_N=e(N) if year == `t'
 15.                 }
 16.                 
.                 * Keep one record per state
.                 qui keep year treat_b treat_N
 17.                 qui bysort year: keep if _n == 1
 18.                 qui gen state = `i'
 19. 
.                 qui save $tempfiles/dd_placebo_`x'`i'.dta, replace
 20.   }             
 21.         di "--> END (state=`i' of 51) time: "c(current_time)
 22.   }
--> END (state=1 of 51) time: 06:41:25
--> END (state=2 of 51) time: 06:41:26
--> END (state=3 of 51) time: 06:41:27
--> END (state=4 of 51) time: 06:41:29
--> END (state=5 of 51) time: 06:41:31
--> END (state=6 of 51) time: 06:41:32
--> END (state=7 of 51) time: 06:41:34
--> END (state=9 of 51) time: 06:41:35
--> END (state=10 of 51) time: 06:41:38
--> END (state=11 of 51) time: 06:41:43
--> END (state=12 of 51) time: 06:41:49
--> END (state=13 of 51) time: 06:41:51
--> END (state=14 of 51) time: 06:41:53
--> END (state=15 of 51) time: 06:41:54
--> END (state=16 of 51) time: 06:41:57
--> END (state=17 of 51) time: 06:41:59
--> END (state=18 of 51) time: 06:42:01
--> END (state=19 of 51) time: 06:42:02
--> END (state=20 of 51) time: 06:42:03
--> END (state=21 of 51) time: 06:42:04
--> END (state=22 of 51) time: 06:42:06
--> END (state=23 of 51) time: 06:42:08
--> END (state=24 of 51) time: 06:42:10
--> END (state=25 of 51) time: 06:42:11
--> END (state=26 of 51) time: 06:42:12
--> END (state=27 of 51) time: 06:42:12
--> END (state=28 of 51) time: 06:42:15
--> END (state=29 of 51) time: 06:42:16
--> END (state=30 of 51) time: 06:42:17
--> END (state=31 of 51) time: 06:42:19
--> END (state=32 of 51) time: 06:42:20
--> END (state=33 of 51) time: 06:42:22
--> END (state=34 of 51) time: 06:42:23
--> END (state=35 of 51) time: 06:42:24
--> END (state=36 of 51) time: 06:42:26
--> END (state=37 of 51) time: 06:42:27
--> END (state=38 of 51) time: 06:42:29
--> END (state=39 of 51) time: 06:42:29
--> END (state=40 of 51) time: 06:42:30
--> END (state=41 of 51) time: 06:42:33
--> END (state=42 of 51) time: 06:42:34
--> END (state=43 of 51) time: 06:42:35
--> END (state=44 of 51) time: 06:42:38
--> END (state=45 of 51) time: 06:42:39
--> END (state=46 of 51) time: 06:42:40
--> END (state=47 of 51) time: 06:42:42
--> END (state=48 of 51) time: 06:42:43
--> END (state=49 of 51) time: 06:42:45
--> END (state=50 of 51) time: 06:42:46
--> END (state=51 of 51) time: 06:42:47

. 
.   
. * b) Constructing the event study
.   foreach x in totalprison lntotalprison lnjurisdiction lnjurisdiction_rate {
  2.   
.         * Append all placebo estimates
.         use $tempfiles/dd_placebo_`x'1.dta, replace
  3.         
.         foreach i of numlist 2/7 9/51 {                         
  4.         qui append using $tempfiles/dd_placebo_`x'`i'.dta
  5.         }
  6.                 
.         * Identify the treated unit(s)
.         qui gen tx = 0 
  7.         replace tx = 1 if (state==44)
  8.         label variable tx "Texas"
  9.                 
.         * Get the 5th and 95th percentiles
.         qui gen p05 = .
 10.         qui gen p95 = .
 11.         
.         foreach t of numlist 1985(1)1992 1994(1)2003 {
 12.         qui summ treat_b if year == `t' & tx != 1, de
 13.         qui replace p05 = r(p5) if year == `t'
 14.         qui replace p95 = r(p95) if year == `t'
 15.         }
 16.         
.         save $inference/placebo/dd_placebo_`x'.dta, replace
 17. 
.         * Plot the event study
.         #delimit ;
delimiter now ;
.         twoway  (scatter treat_b year if tx!=1, msymbol(circle_hollow) mlcolor(black*0.75) mlwidth(vvvthin) jitter(0)) 
>                         (connected treat_b year if tx==1, msymbol(circle) mcolor(blue) lcolor(blue))
>                         (connected p05 year if tx==1, msymbol(point) mcolor(black) lcolor(black) lpattern(dash))
>                         (connected p95 year if tx==1, msymbol(point) mcolor(black) lcolor(black) lpattern(dash))
>                         , 
>                         xtitle(Year)
>                         xtick(1985(3)2003) xmtick(1985(1)2003) xlabel(1985(3)2003)
>                         xline(1993, lcolor(black))
>                         ytitle(Placebo coefficient)
>                         ytick(-300(100)300) ylabel(-300(100)300) yline(0, lcolor(black))
>                         legend(off)
>                         graphregion(fcolor(white))
>                         ;
 18.         #delimit cr
delimiter now cr
.         
.         graph save $figures/Event_Studies/eventStudy_`x'.gph, replace
 19.         graph export $figures/Event_Studies/eventStudy_`x'.pdf, replace
 20.   }
(SAS creation date 15MAR09:08:25)
(19 real changes made)
file ../inference/placebo/dd_placebo_totalprison.dta saved
(note: file ../figures/Event_Studies/eventStudy_totalprison.gph not found)
(file ../figures/Event_Studies/eventStudy_totalprison.gph saved)
(file /Users/scott_cunningham/Dropbox/Workshop/Texas/Do/../figures/Event_Studies/eventStudy_totalprison.pdf written in PDF format)
(SAS creation date 15MAR09:08:25)
(19 real changes made)
(note: file ../inference/placebo/dd_placebo_lntotalprison.dta not found)
file ../inference/placebo/dd_placebo_lntotalprison.dta saved
(note: file ../figures/Event_Studies/eventStudy_lntotalprison.gph not found)
(file ../figures/Event_Studies/eventStudy_lntotalprison.gph saved)
(file /Users/scott_cunningham/Dropbox/Workshop/Texas/Do/../figures/Event_Studies/eventStudy_lntotalprison.pdf written in PDF format)
(SAS creation date 15MAR09:08:25)
(19 real changes made)
(note: file ../inference/placebo/dd_placebo_lnjurisdiction.dta not found)
file ../inference/placebo/dd_placebo_lnjurisdiction.dta saved
(note: file ../figures/Event_Studies/eventStudy_lnjurisdiction.gph not found)
(file ../figures/Event_Studies/eventStudy_lnjurisdiction.gph saved)
(file /Users/scott_cunningham/Dropbox/Workshop/Texas/Do/../figures/Event_Studies/eventStudy_lnjurisdiction.pdf written in PDF format)
(SAS creation date 15MAR09:08:25)
(19 real changes made)
(note: file ../inference/placebo/dd_placebo_lnjurisdiction_rate.dta not found)
file ../inference/placebo/dd_placebo_lnjurisdiction_rate.dta saved
(note: file ../figures/Event_Studies/eventStudy_lnjurisdiction_rate.gph not found)
(file ../figures/Event_Studies/eventStudy_lnjurisdiction_rate.gph saved)
(file /Users/scott_cunningham/Dropbox/Workshop/Texas/Do/../figures/Event_Studies/eventStudy_lnjurisdiction_rate.pdf written in PDF forma
> t)

. 
. 
end of do-file

. do "/Users/scott_cunningham/Dropbox/Workshop/Do/.tm-stata-97202.do"

. clear all

. program define gap, rclass
  1.         version 14.2
  2.         syntax [, obs(integer 1) mu(real 0) sigma(real 1) ]
  3. 
.         clear
  4.         drop _all
  5.         set obs 10
  6.         
.         gen     y1 = 7 in 1
  7.         replace y1 = 5 in 2
  8.         replace y1 = 5 in 3
  9.         replace y1 = 7 in 4
 10.         replace y1 = 4 in 5
 11.         replace y1 = 10 in 6
 12.         replace y1 = 1 in 7
 13.         replace y1 = 5 in 8
 14.         replace y1 = 3 in 9
 15.         replace y1 = 9 in 10
 16. 
.         gen     y0 = 1 in 1
 17.         replace y0 = 6 in 2
 18.         replace y0 = 1 in 3
 19.         replace y0 = 8 in 4
 20.         replace y0 = 2 in 5
 21.         replace y0 = 1 in 6
 22.         replace y0 = 10 in 7
 23.         replace y0 = 6 in 8
 24.         replace y0 = 7 in 9
 25.         replace y0 = 8 in 10
 26.         
.         drawnorm random
 27.         sort random
 28.         
.         gen     d=1 in 1/5
 29.         replace d=0 in 6/10
 30. 
. gen     te = y1 - y0
 31. gen     y=d*y1 + (1-d)*y0
 32. 
. egen sy1 = mean(y) if d==1
 33. egen sy0 = mean(y) if d==0
 34.                                         
. egen ate = mean(te)
 35. 
. collapse (mean) ate sy1 sy0
 36. gen sdo = sy1 - sy0
 37. keep ate sdo
 38. 
. summarize sdo
 39. 
. gen mean = r(mean)
 40. 
. end

. 
. simulate mean, reps(10000): gap

      command:  gap
       _sim_1:  mean

Simulations (10000)
----+--- 1 ---+--- 2 ---+--- 3 ---+--- 4 ---+--- 5 
..................................................    50
..................................................   100
..................................................   150
..................................................   200
..................................................   250
..................................................   300
..................................................   350
..................................................   400
..................................................   450
..................................................   500
..................................................   550
..................................................   600
..................................................   650
..................................................   700
..................................................   750
..................................................   800
..................................................   850
..................................................   900
..................................................   950
..................................................  1000
..................................................  1050
..................................................  1100
..................................................  1150
..................................................  1200
..................................................  1250
..................................................  1300
..................................................  1350
..................................................  1400
..................................................  1450
..................................................  1500
..................................................  1550
..................................................  1600
..................................................  1650
..................................................  1700
..................................................  1750
..................................................  1800
..................................................  1850
..................................................  1900
..................................................  1950
..................................................  2000
..................................................  2050
..................................................  2100
..................................................  2150
..................................................  2200
..................................................  2250
..................................................  2300
..................................................  2350
..................................................  2400
..................................................  2450
..................................................  2500
..................................................  2550
..................................................  2600
..................................................  2650
..................................................  2700
..................................................  2750
..................................................  2800
..................................................  2850
..................................................  2900
..................................................  2950
..................................................  3000
..................................................  3050
..................................................  3100
..................................................  3150
..................................................  3200
..................................................  3250
..................................................  3300
..................................................  3350
..................................................  3400
..................................................  3450
..................................................  3500
..................................................  3550
..................................................  3600
..................................................  3650
..................................................  3700
..................................................  3750
..................................................  3800
..................................................  3850
..................................................  3900
..................................................  3950
..................................................  4000
..................................................  4050
..................................................  4100
..................................................  4150
..................................................  4200
..................................................  4250
..................................................  4300
..................................................  4350
..................................................  4400
..................................................  4450
..................................................  4500
..................................................  4550
..................................................  4600
..................................................  4650
..................................................  4700
..................................................  4750
..................................................  4800
..................................................  4850
..................................................  4900
..................................................  4950
..................................................  5000
..................................................  5050
..................................................  5100
..................................................  5150
..................................................  5200
..................................................  5250
..................................................  5300
..................................................  5350
..................................................  5400
..................................................  5450
..................................................  5500
..................................................  5550
..................................................  5600
..................................................  5650
..................................................  5700
..................................................  5750
..................................................  5800
..................................................  5850
..................................................  5900
..................................................  5950
..................................................  6000
..................................................  6050
..................................................  6100
..................................................  6150
..................................................  6200
..................................................  6250
..................................................  6300
..................................................  6350
..................................................  6400
..................................................  6450
..................................................  6500
..................................................  6550
..................................................  6600
..................................................  6650
..................................................  6700
..................................................  6750
..................................................  6800
..................................................  6850
..................................................  6900
..................................................  6950
..................................................  7000
..................................................  7050
..................................................  7100
..................................................  7150
..................................................  7200
..................................................  7250
..................................................  7300
..................................................  7350
..................................................  7400
..................................................  7450
..................................................  7500
..................................................  7550
..................................................  7600
..................................................  7650
..................................................  7700
..................................................  7750
..................................................  7800
..................................................  7850
..................................................  7900
..................................................  7950
..................................................  8000
..................................................  8050
..................................................  8100
..................................................  8150
..................................................  8200
..................................................  8250
..................................................  8300
..................................................  8350
..................................................  8400
..................................................  8450
..................................................  8500
..................................................  8550
..................................................  8600
..................................................  8650
..................................................  8700
..................................................  8750
..................................................  8800
..................................................  8850
..................................................  8900
..................................................  8950
..................................................  9000
..................................................  9050
..................................................  9100
..................................................  9150
..................................................  9200
..................................................  9250
..................................................  9300
..................................................  9350
..................................................  9400
..................................................  9450
..................................................  9500
..................................................  9550
..................................................  9600
..................................................  9650
..................................................  9700
..................................................  9750
..................................................  9800
..................................................  9850
..................................................  9900
..................................................  9950
.................................................. 10000

. 
. su _sim_1 

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      _sim_1 |     10,000      .58998    1.104805       -1.8          3

. hist _sim_1 
(bin=40, start=-1.8000002, width=.12)

. 
. 
end of do-file

. do "/Users/scott_cunningham/Dropbox/Workshop/Do/.tm-stata-97319.do"

. clear all

. program define gap, rclass
  1.         version 14.2
  2.         syntax [, obs(integer 1) mu(real 0) sigma(real 1) ]
  3. 
.         clear
  4.         drop _all
  5.         set obs 10
  6.         
.         gen     y1 = 7 in 1
  7.         replace y1 = 5 in 2
  8.         replace y1 = 5 in 3
  9.         replace y1 = 7 in 4
 10.         replace y1 = 4 in 5
 11.         replace y1 = 10 in 6
 12.         replace y1 = 1 in 7
 13.         replace y1 = 5 in 8
 14.         replace y1 = 3 in 9
 15.         replace y1 = 9 in 10
 16. 
.         gen     y0 = 1 in 1
 17.         replace y0 = 6 in 2
 18.         replace y0 = 1 in 3
 19.         replace y0 = 8 in 4
 20.         replace y0 = 2 in 5
 21.         replace y0 = 1 in 6
 22.         replace y0 = 10 in 7
 23.         replace y0 = 6 in 8
 24.         replace y0 = 7 in 9
 25.         replace y0 = 8 in 10
 26.         
.         drawnorm random
 27.         sort random
 28.         
.         gen     d=1 in 1/5
 29.         replace d=0 in 6/10
 30. 
. gen     te = y1 - y0
 31. gen     y=d*y1 + (1-d)*y0
 32. 
. egen sy1 = mean(y) if d==1
 33. egen sy0 = mean(y) if d==0
 34.                                         
. egen ate = mean(te)
 35. 
. collapse (mean) ate sy1 sy0
 36. gen sdo = sy1 - sy0
 37. keep ate sdo
 38. 
. summarize sdo
 39. 
. gen mean = r(mean)
 40. 
. end

. 
. simulate mean, reps(10000): gap

      command:  gap
       _sim_1:  mean

Simulations (10000)
----+--- 1 ---+--- 2 ---+--- 3 ---+--- 4 ---+--- 5 
..................................................    50
..................................................   100
..................................................   150
..................................................   200
..................................................   250
..................................................   300
..................................................   350
..................................................   400
..................................................   450
..................................................   500
..................................................   550
..................................................   600
..................................................   650
..................................................   700
..................................................   750
..................................................   800
..................................................   850
..................................................   900
..................................................   950
..................................................  1000
..................................................  1050
..................................................  1100
..................................................  1150
..................................................  1200
..................................................  1250
..................................................  1300
..................................................  1350
..................................................  1400
..................................................  1450
..................................................  1500
..................................................  1550
..................................................  1600
..................................................  1650
..................................................  1700
..................................................  1750
..................................................  1800
..................................................  1850
..................................................  1900
..................................................  1950
..................................................  2000
..................................................  2050
..................................................  2100
..................................................  2150
..................................................  2200
..................................................  2250
..................................................  2300
..................................................  2350
..................................................  2400
..................................................  2450
..................................................  2500
..................................................  2550
..................................................  2600
..................................................  2650
..................................................  2700
..................................................  2750
..................................................  2800
..................................................  2850
..................................................  2900
..................................................  2950
..................................................  3000
..................................................  3050
..................................................  3100
..................................................  3150
..................................................  3200
..................................................  3250
..................................................  3300
..................................................  3350
..................................................  3400
..................................................  3450
..................................................  3500
..................................................  3550
..................................................  3600
..................................................  3650
..................................................  3700
..................................................  3750
..................................................  3800
..................................................  3850
..................................................  3900
..................................................  3950
..................................................  4000
..................................................  4050
..................................................  4100
..................................................  4150
..................................................  4200
..................................................  4250
..................................................  4300
..................................................  4350
..................................................  4400
..................................................  4450
..................................................  4500
..................................................  4550
..................................................  4600
..................................................  4650
..................................................  4700
..................................................  4750
..................................................  4800
..................................................  4850
..................................................  4900
..................................................  4950
..................................................  5000
..................................................  5050
..................................................  5100
..................................................  5150
..................................................  5200
..................................................  5250
..................................................  5300
..................................................  5350
..................................................  5400
..................................................  5450
..................................................  5500
..................................................  5550
..................................................  5600
..................................................  5650
..................................................  5700
..................................................  5750
..................................................  5800
..................................................  5850
..................................................  5900
..................................................  5950
..................................................  6000
..................................................  6050
..................................................  6100
..................................................  6150
..................................................  6200
..................................................  6250
..................................................  6300
..................................................  6350
..................................................  6400
..................................................  6450
..................................................  6500
..................................................  6550
..................................................  6600
..................................................  6650
..................................................  6700
..................................................  6750
..................................................  6800
..................................................  6850
..................................................  6900
..................................................  6950
..................................................  7000
..................................................  7050
..................................................  7100
..................................................  7150
..................................................  7200
..................................................  7250
..................................................  7300
..................................................  7350
..................................................  7400
..................................................  7450
..................................................  7500
..................................................  7550
..................................................  7600
..................................................  7650
..................................................  7700
..................................................  7750
..................................................  7800
..................................................  7850
..................................................  7900
..................................................  7950
..................................................  8000
..................................................  8050
..................................................  8100
..................................................  8150
..................................................  8200
..................................................  8250
..................................................  8300
..................................................  8350
..................................................  8400
..................................................  8450
..................................................  8500
..................................................  8550
..................................................  8600
..................................................  8650
..................................................  8700
..................................................  8750
..................................................  8800
..................................................  8850
..................................................  8900
..................................................  8950
..................................................  9000
..................................................  9050
..................................................  9100
..................................................  9150
..................................................  9200
..................................................  9250
..................................................  9300
..................................................  9350
..................................................  9400
..................................................  9450
..................................................  9500
..................................................  9550
..................................................  9600
..................................................  9650
..................................................  9700
..................................................  9750
..................................................  9800
..................................................  9850
..................................................  9900
..................................................  9950
.................................................. 10000

. 
. su _sim_1 

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      _sim_1 |     10,000      .60934    1.098347       -1.8          3

. kdensity _sim_1 

. 
. 
end of do-file

. do "/Users/scott_cunningham/Dropbox/Workshop/Do/.tm-stata-98132.do"

. clear all

. program define gap, rclass
  1.         version 14.2
  2.         syntax [, obs(integer 1) mu(real 0) sigma(real 1) ]
  3. 
.         clear
  4.         drop _all
  5.         set obs 10
  6.         
.         gen     y1 = 7 in 1
  7.         replace y1 = 5 in 2
  8.         replace y1 = 5 in 3
  9.         replace y1 = 7 in 4
 10.         replace y1 = 4 in 5
 11.         replace y1 = 10 in 6
 12.         replace y1 = 1 in 7
 13.         replace y1 = 5 in 8
 14.         replace y1 = 3 in 9
 15.         replace y1 = 9 in 10
 16. 
.         gen     y0 = 1 in 1
 17.         replace y0 = 6 in 2
 18.         replace y0 = 1 in 3
 19.         replace y0 = 8 in 4
 20.         replace y0 = 2 in 5
 21.         replace y0 = 1 in 6
 22.         replace y0 = 10 in 7
 23.         replace y0 = 6 in 8
 24.         replace y0 = 7 in 9
 25.         replace y0 = 8 in 10
 26.         
.         drawnorm random
 27.         sort random
 28.         
.         gen     d=1 in 1/5
 29.         replace d=0 in 6/10
 30. 
. gen     te = y1 - y0
 31. gen     y=d*y1 + (1-d)*y0
 32. 
. egen sy1 = mean(y) if d==1
 33. egen sy0 = mean(y) if d==0
 34.                                         
. egen ate = mean(te)
 35. 
. collapse (mean) ate sy1 sy0
 36. gen sdo = sy1 - sy0
 37. keep ate sdo
 38. 
. summarize sdo
 39. 
. gen mean = r(mean)
 40. 
. end

. 
. simulate mean, reps(10000): gap

      command:  gap
       _sim_1:  mean

Simulations (10000)
----+--- 1 ---+--- 2 ---+--- 3 ---+--- 4 ---+--- 5 
..................................................    50
..................................................   100
..................................................   150
..................................................   200
..................................................   250
..................................................   300
..................................................   350
..................................................   400
..................................................   450
..................................................   500
..................................................   550
..................................................   600
..................................................   650
..................................................   700
..................................................   750
..................................................   800
..................................................   850
..................................................   900
..................................................   950
..................................................  1000
..................................................  1050
..................................................  1100
..................................................  1150
..................................................  1200
..................................................  1250
..................................................  1300
..................................................  1350
..................................................  1400
..................................................  1450
..................................................  1500
..................................................  1550
..................................................  1600
..................................................  1650
..................................................  1700
..................................................  1750
..................................................  1800
..................................................  1850
..................................................  1900
..................................................  1950
..................................................  2000
..................................................  2050
..................................................  2100
..................................................  2150
..................................................  2200
..................................................  2250
..................................................  2300
..................................................  2350
..................................................  2400
..................................................  2450
..................................................  2500
..................................................  2550
..................................................  2600
..................................................  2650
..................................................  2700
..................................................  2750
..................................................  2800
..................................................  2850
..................................................  2900
..................................................  2950
..................................................  3000
..................................................  3050
..................................................  3100
..................................................  3150
..................................................  3200
..................................................  3250
..................................................  3300
..................................................  3350
..................................................  3400
..................................................  3450
..................................................  3500
..................................................  3550
..................................................  3600
..................................................  3650
..................................................  3700
..................................................  3750
..................................................  3800
..................................................  3850
..................................................  3900
..................................................  3950
..................................................  4000
..................................................  4050
..................................................  4100
..................................................  4150
..................................................  4200
..................................................  4250
..................................................  4300
..................................................  4350
..................................................  4400
..................................................  4450
..................................................  4500
..................................................  4550
..................................................  4600
..................................................  4650
..................................................  4700
..................................................  4750
..................................................  4800
..................................................  4850
..................................................  4900
..................................................  4950
..................................................  5000
..................................................  5050
..................................................  5100
..................................................  5150
..................................................  5200
..................................................  5250
..................................................  5300
..................................................  5350
..................................................  5400
..................................................  5450
..................................................  5500
..................................................  5550
..................................................  5600
..................................................  5650
..................................................  5700
..................................................  5750
..................................................  5800
..................................................  5850
..................................................  5900
..................................................  5950
..................................................  6000
..................................................  6050
..................................................  6100
..................................................  6150
..................................................  6200
..................................................  6250
..................................................  6300
..................................................  6350
..................................................  6400
..................................................  6450
..................................................  6500
..................................................  6550
..................................................  6600
..................................................  6650
..................................................  6700
..................................................  6750
..................................................  6800
..................................................  6850
..................................................  6900
..................................................  6950
..................................................  7000
..................................................  7050
..................................................  7100
..................................................  7150
..................................................  7200
..................................................  7250
..................................................  7300
..................................................  7350
..................................................  7400
..................................................  7450
..................................................  7500
..................................................  7550
..................................................  7600
..................................................  7650
..................................................  7700
..................................................  7750
..................................................  7800
..................................................  7850
..................................................  7900
..................................................  7950
..................................................  8000
..................................................  8050
..................................................  8100
..................................................  8150
..................................................  8200
..................................................  8250
..................................................  8300
..................................................  8350
..................................................  8400
..................................................  8450
..................................................  8500
..................................................  8550
..................................................  8600
..................................................  8650
..................................................  8700
..................................................  8750
..................................................  8800
..................................................  8850
..................................................  8900
..................................................  8950
..................................................  9000
..................................................  9050
..................................................  9100
..................................................  9150
..................................................  9200
..................................................  9250
..................................................  9300
..................................................  9350
..................................................  9400
..................................................  9450
..................................................  9500
..................................................  9550
..................................................  9600
..................................................  9650
..................................................  9700
..................................................  9750
..................................................  9800
..................................................  9850
..................................................  9900
..................................................  9950
.................................................. 10000

. 
. su _sim_1 

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      _sim_1 |     10,000      .61632    1.094443       -1.8          3

. kdensity _sim_1 

. 
. 
end of do-file

. graph save Graph "/Users/scott_cunningham/Dropbox/Classes/Causality and Research Design/Slides/lecture_includes/po_random.gph"
(file /Users/scott_cunningham/Dropbox/Classes/Causality and Research Design/Slides/lecture_includes/po_random.gph saved)
clear

. use "/Users/scott_cunningham/Dropbox/Indy/Data/reviews.dta"

. do "/Users/scott_cunningham/Dropbox/Indy/Do/.tm-stata-5002.do"

. ********************************************************************
. * name: mechanism.do
. * author: scott cunningham (baylor) and greg deangelo (wvu) and john tripp (baylor)
. * description: estimating mechanism models using TER data
. * last update: august 21, 2017
. ********************************************************************
. 
. clear

. capture log close
